
#pragma once
#include <Windows.h>
#include <vector>
#include <dxgi.h>
#include <d3d11.h>
#include <emmintrin.h>
#include "../ragemp_cheat/src/ImGui/imgui.h"
#include "../ragemp_cheat/src/ImGui/imgui_impl_dx11.h"
#include "../ragemp_cheat/src/ImGui/imgui_impl_win32.h"

#include "../ragemp_cheat/src/ImGui/imgui_internal.h"
#include "../ragemp_cheat/src/ImGui/imgui_freetype.h"
#include <D3DX11tex.h>
#pragma comment(lib, "D3DX11.lib")


#include <D3dx9math.h>
#include <stdint.h>
#include <Windows.h>
#include <psapi.h>
#include <d3d11.h>
#include <string>
#include <codecvt>
#include <locale>
#include <cstdint>
#include <algorithm>
#include <iostream>
#include <iomanip>
#include <emmintrin.h>
#include <iostream>
#include <vector>
#include <fstream>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <float.h>
#include <signal.h>
#include <sstream>
#include <stdio.h>
#include <thread>
#include <comdef.h>

#pragma comment(lib, "ws2_32.lib")
#pragma comment(lib, "crypt32.lib")
#pragma comment(lib, "D:/sourca/amthsave7/AMTH/cpr.lib")
#pragma comment(lib, "D:/sourca/amthsave7/AMTH/zlib.lib")
#pragma comment(lib, "D:/sourca/amthsave7/AMTH/libcurl.lib")
#include "Urlmon.h"
#pragma comment(lib, "Urlmon.lib")
#define STB_IMAGE_IMPLEMENTATION
#include "../ragemp_cheat/src/Vector.hpp"
#include "../ragemp_cheat/src/xorstr.hpp"

#pragma once
#include <cmath>

#include <xmmintrin.h>
#include <iostream>
#pragma warning(disable: 4996)


#include "src/Main/vectors.hpp"
#include "src/Main/vars.h"

HWND hWnd;

#pragma warning(disable : 4996)
#define INRANGE(x,a,b)  (x >= a && x <= b) 
#define getBits( x )    (INRANGE((x&(~0x20)),'A','F') ? ((x&(~0x20)) - 'A' + 0xa) : (INRANGE(x,'0','9') ? x - '0' : 0))
#define getByte( x )    (getBits(x[0]) << 4 | getBits(x[1]))

#ifdef _WIN64
#define PTRMAXVAL ((DWORD64)0x000F000000000000)
#else
#define PTRMAXVAL ((DWORD64)0xFFF00000)
#endif
#include "src/encryptfynk.hpp"

namespace Helper
{
	bool ValidPTR(DWORD64 ptr)
	{
		if (ptr >= 0x10000 && ptr < PTRMAXVAL)
			return true;

		return false;
	}

	DWORD64 FindPattern(const char* szModule, const char* szSignature)
	{
		MODULEINFO modInfo;
		GetModuleInformation(SAFE_CALL(GetCurrentProcess)(), SAFE_CALL(GetModuleHandleA)(szModule), &modInfo, sizeof(MODULEINFO));
		DWORD64 startAddress = (DWORD64)SAFE_CALL(GetModuleHandleA)(szModule);
		DWORD64 endAddress = (startAddress + (DWORD64)modInfo.SizeOfImage);
		const char* pat = szSignature;
		DWORD64 firstMatch = 0;
		for (DWORD64 pCur = startAddress; pCur < endAddress; pCur++)
		{
			if (!*pat) return firstMatch;
			if (*(PBYTE)pat == ('\?') || *(BYTE*)pCur == getByte(pat))
			{
				if (!firstMatch) firstMatch = pCur;
				if (!pat[2]) return firstMatch;
				if (*(PWORD)pat == ('\?\?') || *(PBYTE)pat != ('\?')) pat += 3;
				else pat += 2;
			}
			else {
				pat = szSignature;
				firstMatch = 0;
			}
		}
		return NULL;
	}
	SIZE_T GetPointerAddress(SIZE_T Address, UINT Offset)
	{
		if (Address == 0)
			return 0;

		if (sizeof(SIZE_T) == 8)
			return Address + (INT)((*(INT*)(Address + Offset) + Offset) + sizeof(INT));

		return (SIZE_T) * (DWORD*)(Address + Offset);
	}

}


namespace global_nat_platf {
	int version_platform = 0; //1 altv || 2 ragemp
}

namespace image
{
	ID3D11ShaderResourceView* roll = nullptr;

	ID3D11ShaderResourceView* rusifikacia = nullptr;
	ID3D11ShaderResourceView* rusifikacia_ru = nullptr;
	ID3D11ShaderResourceView* discord_logo = nullptr;
	ID3D11ShaderResourceView* telegram_logo = nullptr;
	ID3D11ShaderResourceView* vk_logo = nullptr;
	ID3D11ShaderResourceView* site_logo = nullptr;
}
namespace font
{
	ImFont* poppins_medium = nullptr;
	ImFont* poppins_medium_low = nullptr;
	ImFont* tab_icon = nullptr;
	ImFont* chicons = nullptr;
	ImFont* tahoma_bold = nullptr;
	ImFont* tahoma_bold2 = nullptr;
}
//ImFont* m_pFont2 = font::poppins_medium;

#include <ShlObj_core.h>
//#include "src/stb_image.h"
#include <Windows.h>
#include <winternl.h>
#include <utility>
#include <optional>
#include <string>
using namespace std;
template<typename T>
class Singleton
{
protected:
	Singleton() {}
	~Singleton() {}

	Singleton(const Singleton&) = delete;
	Singleton& operator=(const Singleton&) = delete;

	Singleton(Singleton&&) = delete;
	Singleton& operator=(Singleton&&) = delete;

public:
	static T& Instance()
	{
		static T inst{};
		return inst;
	}
};
class Vehicle_r : public Singleton<Vehicle_r>
{
public:
	void Tick();
};
#include <functional>
float get_distance_between_coords_3d(Vector3 from, Vector3 to)
{
	return (float)sqrt(pow(double(from.x - to.x), 2.0) + pow(double(from.y - to.y), 2.0) + pow(double(from.z - to.z), 2.0));
}

#include <Psapi.h>
#include <sstream>
#include <optional>
#include <array>

namespace sy
{
	class handle {
	public:
		handle() = default;
		explicit handle(uintptr_t address) : m_Address(address) {}

		template <typename T>
		T as() const {
			return reinterpret_cast<T>(m_Address);
		}

		handle add(uintptr_t offset) const {
			if (m_Address != 0)
			{
				return handle(m_Address + offset);
			}

			return *this;
		}

		handle sub(uintptr_t offset) const {
			if (m_Address != 0)
			{
				return handle(m_Address - offset);
			}

			return *this;
		}

		handle rip() const {
			if (m_Address != 0)
			{
				auto offset = *as<int32_t*>();
				return add(offset + sizeof(int32_t));
			}

			return *this;
		}

		uintptr_t get_address()
		{
			return m_Address;
		}

	private:
		uintptr_t m_Address = 0;
	};


	class _module {
	public:
		_module(const char* module) : m_Module(module)
		{
			m_ModuleHandle = GetModuleHandleA(m_Module);
		}

		handle get_export(const char* func)
		{
			return handle((std::uintptr_t)GetProcAddress(m_ModuleHandle, func));
		}

		HMODULE get_handle()
		{
			return m_ModuleHandle;
		}

	private:
		const char* m_Module;
		HMODULE m_ModuleHandle;
	};

	class pattern {
	public:
		explicit pattern(_module module);
		~pattern() noexcept;

		pattern& scanNow(std::string sigName, std::string  IDASig);
		pattern& scanAllNow(std::string sigName, std::string  IDASig);

		handle getResult();
		std::vector<handle> getAllResults();
	private:
		_module m_Module;
		size_t m_ModuleSize;
		HMODULE m_ModuleHandle;
		handle m_Result;
		std::vector<handle> m_AllResults;
	};

	class offset {
	public:
		explicit offset(uint64_t offset, _module module = "GTA5.exe");
		~offset() noexcept;

		handle& getResult();
		uintptr_t& getAddress();
	private:
		uint64_t m_Offset;
		_module m_Module;
		handle m_Result;
		HMODULE m_ModuleHandle;
		uintptr_t m_Address;
	};
}
 //#include <utility>
namespace sy
{
	std::vector<std::optional<uint8_t>> parseIDASignature(const char* sig) {
		std::vector<std::optional<uint8_t>> bytes;
		std::stringstream ss(sig);

		while (!ss.eof()) {
			std::string byte_str;
			ss >> byte_str;

			if (byte_str == "?" || byte_str == "??") {
				bytes.push_back(std::nullopt);
				continue;
			}

			if (byte_str.length() != 2) {
				throw std::runtime_error("Invalid byte in IDA signature: " + byte_str);
			}

			char* end;
			long value = strtol(byte_str.c_str(), &end, 16);

			if (*end != '\0') {
				throw std::runtime_error("Invalid byte in IDA signature: " + byte_str);
			}

			bytes.push_back(static_cast<uint8_t>(value));
		}

		return bytes;
	}


	pattern::pattern(_module module) :
		m_Module(module), m_Result(0)
	{
		m_ModuleHandle = m_Module.get_handle();

		if (m_ModuleHandle == nullptr) {
			throw std::runtime_error("Could not find module!");
		}

		MODULEINFO mi = { 0 };

		if (!GetModuleInformation(GetCurrentProcess(), m_ModuleHandle, &mi, sizeof(mi))) {
			throw std::runtime_error("Could not get module information!");
		}
		m_ModuleSize = mi.SizeOfImage;
	}

	pattern::~pattern() {}

	pattern& pattern::scanAllNow(std::string sigName, std::string  IDASig)
	{
		auto signature = parseIDASignature(IDASig.c_str());

		std::uintptr_t base_address = reinterpret_cast<std::uintptr_t>(m_ModuleHandle);

		std::size_t sig_size = signature.size();
		std::uintptr_t end_address = base_address + m_ModuleSize - sig_size;

		std::array<int, 256> bad_char;
		for (int i = 0; i < 256; ++i) {
			bad_char[i] = sig_size;
		}
		for (int i = 0; i < sig_size - 1; ++i) {
			if (signature[i].has_value()) {
				bad_char[signature[i].value()] = sig_size - i - 1;
			}
			else {
				for (int j = 0; j < 256; ++j) {
					bad_char[j] = min(bad_char[j], sig_size - i - 1);
				}
			}
		}

		std::uintptr_t i = base_address + sig_size - 1;
		while (i < end_address) {
			int j = sig_size - 1;
			while (j >= 0) {
				if (signature[j].has_value() && signature[j].value() != *reinterpret_cast<uint8_t*>(i - sig_size + j + 1))
					break;
				--j;
			}
			if (j < 0) {
				m_Result = handle(i - sig_size + 1);
				//..g_Logger->logNow("Found pattern: " + sigName, logClass::GENERAL);
				m_AllResults.push_back(m_Result);
			}
			i += max(bad_char[*reinterpret_cast<uint8_t*>(i)], static_cast<int>(sig_size - j - 1));
		}

		//if (!m_AllResults.empty())
			//..g_Logger->logNow("Failed to find pattern: " + sigName, logClass::ALERT);

		return *this;
	}


	pattern& pattern::scanNow(std::string sigName, std::string  IDASig)
	{
		auto signature = parseIDASignature(IDASig.c_str());

		std::uintptr_t base_address = reinterpret_cast<std::uintptr_t>(m_ModuleHandle);

		std::size_t sig_size = signature.size();
		std::uintptr_t end_address = base_address + m_ModuleSize - sig_size;

		std::array<int, 256> bad_char;
		for (int i = 0; i < 256; ++i) {
			bad_char[i] = sig_size;
		}
		for (int i = 0; i < sig_size - 1; ++i) {
			if (signature[i].has_value()) {
				bad_char[signature[i].value()] = sig_size - i - 1;
			}
			else {
				for (int j = 0; j < 256; ++j) {
					bad_char[j] = min(bad_char[j], sig_size - i - 1);
				}
			}
		}

		std::uintptr_t i = base_address + sig_size - 1;
		while (i < end_address) {
			int j = sig_size - 1;
			while (j >= 0) {
				if (signature[j].has_value() && signature[j].value() != *reinterpret_cast<uint8_t*>(i - sig_size + j + 1))
					break;
				--j;
			}
			if (j < 0) {
				m_Result = handle(i - sig_size + 1);
				//g_Logger->logNow("Found pattern: " + sigName, logClass::GENERAL);
				return *this;
			}
			i += max(bad_char[*reinterpret_cast<uint8_t*>(i)], static_cast<int>(sig_size - j - 1));
		}

	//	g_Logger->logNow("Failed to find pattern: " + sigName, logClass::ALERT);
		m_Result = handle(0);

		return *this;
	}

	handle pattern::getResult()
	{
		return m_Result;
	}

	std::vector<handle> pattern::getAllResults()
	{
		return m_AllResults;
	}


	offset::offset(uint64_t offset, _module module) :
		m_Offset(offset), m_Module(module)
	{
		m_ModuleHandle = m_Module.get_handle();
	}

	offset::~offset() {}

	handle& offset::getResult()
	{
		auto addr = (uintptr_t)m_ModuleHandle + m_Offset;
		m_Result = handle(addr);

		return m_Result;
	}

	uintptr_t& offset::getAddress()
	{
		auto addr = (uintptr_t)m_ModuleHandle + m_Offset;
		return addr;
	}
}
namespace Memory {
	using pointer_handler_t = int32_t(*)(intptr_t pointer);
	pointer_handler_t pointer_to_handle = nullptr;
}


#include "src/NativeInvoker.hpp" //

enum class thread_state_t : std::uint32_t
{
	idle,
	running,
	killed,
	unk_3,
	unk_4,
};


class thread_context_t
{
public:
	std::uint32_t m_thread_id;
	std::uint32_t m_script_hash; // + 4 (program id)
	thread_state_t m_state; // + 8
	std::uint32_t m_instruction_pointer; // 0x0C
	std::uint32_t m_frame_pointer;       // 0x10
	std::uint32_t m_stack_pointer;       // 0x14
	float m_timer_a;                     // 0x18
	float m_timer_b;                     // 0x1C
	float m_timer_c;                     // 0x20
	char m_padding1[0x2C];               // 0x24
	std::uint32_t m_stack_size;          // 0x50
	char m_padding2[0x54];               // 0x54
};

class game_thread
{
public:
	virtual ~game_thread() = default;
	//virtual thread_state_t reset(std::uint32_t script_hash, void* args, std::uint32_t arg_count) = 0;
	//virtual thread_state_t run() = 0;
	//virtual thread_state_t tick() = 0;
	virtual void kill() = 0;

	inline static game_thread*& get() {
		//return *(game_thread**)(*reinterpret_cast<uintptr_t*>(__readgsqword(0x58)) + 0x830);
		return *(game_thread**)(*reinterpret_cast<uintptr_t*>(__readgsqword(0x58)) + 0x830);//new
	}
public:
	thread_context_t m_context; // 0x08
	void* m_stack;              // 0xB0
	char m_padding[0x10];       // 0xB8
	const char* m_exit_message; // 0xC8
	char m_name[0x40];          // 0xD0
	void* m_handler;   // 0x110
	char m_padding2[0x28];      // 0x118
	std::uint8_t m_flag1;       // 0x140
	std::uint8_t m_flag2;       // 0x141
	char m_padding3[0x16];      // 0x142
};

using script_thread_tick_t = uintptr_t(*)(game_thread* thread, int ops_to_execute);
//get_bone_position_t ptr_gta_get_bone_position = nullptr;
script_thread_tick_t gta_script_thread_tick = nullptr;
script_thread_tick_t original_native_thread = nullptr;

namespace fiberq
{
	using script_func_t = void(*)();

	class fiber_task
	{
	public:
		explicit fiber_task(HMODULE hmod, script_func_t func) :
			m_hmodule(hmod),
			m_function(func)
		{ }

		~fiber_task() noexcept
		{
			if (m_script_fiber)
			{
				DeleteFiber(m_script_fiber);
			}
		}

		HMODULE get_hmodule()
		{
			return m_hmodule;
		}

		script_func_t get_function()
		{
			return m_function;
		}

		void on_tick()
		{
			if (GetTickCount64() < m_wake_at)
				return;

			if (!m_main_fiber)
			{
				m_main_fiber = IsThreadAFiber() ? GetCurrentFiber() : ConvertThreadToFiber(nullptr);
			}

			if (m_script_fiber)
			{
				current_fiber_script = this;
				SwitchToFiber(m_script_fiber);
