#include "src/sdkclasses.hpp"
#include <future>






#include <cstdint>
#include <cstddef>
#include <string>
#include <vector>

class c_ped; // def CPed
class c_vehicle; // def CVehicle


#pragma once



namespace Memoryqe
{
	class module_t
	{
	public:
		explicit module_t(HMODULE mod) :
			m_start(reinterpret_cast<uintptr_t>(mod))
		{
			auto module_dos_header = PIMAGE_DOS_HEADER(mod);
			auto nt_file_header = PIMAGE_NT_HEADERS(PBYTE(mod) + module_dos_header->e_lfanew);

			m_end = nt_file_header->OptionalHeader.SizeOfImage;
		}

		explicit module_t(std::pair<HMODULE, size_t> module) :
			m_start(reinterpret_cast<uintptr_t>(module.first)),
			m_end(module.second)
		{}

		explicit module_t(std::string mod) :
			module_t(peb_get_module(std::wstring(mod.begin(), mod.end())))
		{ }

		explicit module_t(const wchar_t* mod) :
			module_t(peb_get_module(mod))
		{ }

		explicit module_t(std::nullptr_t) :
			module_t(SAFE_CALL(GetModuleHandleW)(nullptr))
		{ }

		uintptr_t base()
		{
			return m_start;
		}

		std::size_t size()
		{
			return m_end;
		}

		inline static std::pair<HMODULE, size_t> peb_get_module(std::optional<std::wstring> name)
		{
			auto peb = reinterpret_cast<PEB*>(__readgsqword(0x60));

			auto head = peb->Ldr->InMemoryOrderModuleList;
			auto curr = head;

			if (!name)
			{
				wchar_t file_name[MAX_PATH];
				if (GetModuleFileNameW(SAFE_CALL(GetModuleHandleW)(nullptr), file_name, MAX_PATH))
					*name = file_name;
			}

			while (curr.Flink != head.Blink)
			{
				auto mod = reinterpret_cast<LDR_DATA_TABLE_ENTRY*>((uintptr_t)curr.Flink - 0x10);
				auto base_dll_name = *reinterpret_cast<UNICODE_STRING*>(&mod->Reserved4);
				if (base_dll_name.Buffer)
				{
					if (base_dll_name.Buffer == *name)
						return { reinterpret_cast<HMODULE>(mod->DllBase), reinterpret_cast<size_t>(mod->Reserved3[1]) };

				}

				curr = *curr.Flink;
			}

			return {};
		}

	private:
		uintptr_t	m_start;
		std::size_t	m_end;
	};
}
#include <iostream>
#include <Windows.h>
#include <cstdint>
#include <vector>
#include <sstream>
#include <fstream>
#include <filesystem>
#include <memory>
#include <future>
#include <future>


class vmt_hook
{
public:
	vmt_hook(vmt_hook&& that) = delete;
	vmt_hook& operator=(vmt_hook&& that) = delete;
	vmt_hook(vmt_hook const&) = delete;
	vmt_hook& operator=(vmt_hook const&) = delete;

	explicit vmt_hook(void* obj, std::size_t num_funcs) :
		m_object(static_cast<void***>(obj)),
		m_num_funcs(num_funcs + 1),
		m_original_table(*m_object),
		m_new_table(std::make_unique<void* []>(m_num_funcs))
	{
		std::copy_n(m_original_table - 1, m_num_funcs, m_new_table.get());
	}

	void hook(std::size_t index, void* func)
	{
		m_new_table[index + 1] = func;
	}

	void unhook(std::size_t index)
	{
		m_new_table[index + 1] = m_original_table[index];
	}

	void enable()
	{
		*m_object = m_new_table.get() + 1;
	}

	void disable()
	{
		*m_object = m_original_table;
	}

	template <typename T>
	T get_original(std::size_t index)
	{
		return static_cast<T>(m_original_table[index]);
	}

private:
	void*** m_object;
	std::size_t m_num_funcs;

	void** m_original_table;
	std::unique_ptr<void* []> m_new_table;
};
namespace Memoryqe
{
	inline bool correlate(std::uint8_t* target, const std::optional<std::uint8_t>* sig, std::size_t length)
	{
		for (std::size_t i = 0; i < length; ++i)
		{
			if (sig[i] && *sig[i] != target[i])
				return false;
		}

		return true;
	}

	inline int pattern_id = 0;

	template <typename type = uintptr_t>
	inline type find_pattern(module_t mod, std::string name, std::string pattern, int offset = 0)
	{
		static auto char_to_integer = [](const char c)
			{
				if (c >= '0' && c <= '9')
					return c - '0';
				if (c >= 'A' && c <= 'F')
					return c - 'A' + 10;
				if (c >= 'a' && c <= 'f')
					return c - 'a' + 10;

				return -1;
			};

		std::vector<std::optional<uint8_t>> bytes;

		std::istringstream sigstream(pattern);
		std::vector<std::string> pattern_array
		{
			std::istream_iterator<std::string>(sigstream), {}
		};

		for (auto& byte : pattern_array)
		{
			if (byte == "?")
			{
				bytes.push_back(std::nullopt);
				continue;
			}

			if (auto c1 = char_to_integer(byte[0]); c1 != -1)
			{
				if (auto c2 = char_to_integer(byte[1]); c2 != -1)
				{
					bytes.emplace_back(
						static_cast<uint8_t>(c1 * 0x10 + c2)
					);
				}
			}
		}

		auto data = bytes.data();
		auto length = bytes.size();

		pattern_id++;

		auto base = mod.base();
		for (size_t i = 0; i < mod.size(); i++)
			if (correlate(reinterpret_cast<uint8_t*>(base + i), data, length)) {
				//Log::Debug(_xor_("[+] Memory >>"), name, (base + i + offset), "#" + std::to_string(pattern_id));
				return (type)(base + i + offset);
			}

		//char request[9999];
		//sprintf(request, ("Failed to find signature pattern %s"), name.c_str());
		//SAFE_CALL(MessageBoxW)(0, name.c_str(), "Failed ", MB_ICONERROR);

		/*if (name == "FixContextVector") {
			MessageBoxW(0, L"FixContextVector", (L"Failed"), MB_ICONERROR);
		}*/
		if (name == "gta_thread_collection") {
			MessageBoxW(0, L"gta_thread_collection", (L"Failed"), MB_ICONERROR);
		}
		if (name == "thread_call") {
			MessageBoxW(0, L"thread_call", (L"Failed"), MB_ICONERROR);
		}
		if (name == "thread_switch_tls_t") {
			MessageBoxW(0, L"thread_switch_tls_t", (L"Failed"), MB_ICONERROR);
		}
		//if (name == "get_native_handler_t") {
		//	MessageBoxW(0, L"get_native_handler_t", (L"Failed"), MB_ICONERROR);
		//}

		return (type)(nullptr);
	}

	template <typename type>
	type as_relative(type address, int offset = 3)
	{
		return reinterpret_cast<type>(reinterpret_cast<uintptr_t>(address) + *reinterpret_cast<int*>(reinterpret_cast<uintptr_t>(address) + offset) + (offset + 4i32));
	}

	template <typename type = uintptr_t>
	type as_relative(void* address, int offset = 3)
	{
		return reinterpret_cast<type>(reinterpret_cast<uintptr_t>(address) + *reinterpret_cast<int*>(reinterpret_cast<uintptr_t>(address) + offset) + (offset + 4i32));
	}

	template <typename type = uintptr_t>
	type as_relative(uintptr_t address, int offset = 3)
	{
		return (type)(address + *reinterpret_cast<int*>(address + offset) + (offset + 4i32));
	}
}
std::optional<std::uintptr_t> get_rva(const std::uintptr_t address, const int first_offset, const int second_offset)
{
	if (address >= 0x3000)
	{
		std::uintptr_t result = *reinterpret_cast<int32_t*>(
			address + first_offset)
			+ address + second_offset;

		return result;
	}

	return std::nullopt;
}









#include <vector>
#include <sysinfoapi.h>
#include <functional>
namespace fiber
{
	using script_func_t = void(*)();

	class fiber_task
	{
	public:
		explicit fiber_task(HMODULE hmod, script_func_t func) :
			m_hmodule(hmod),
			m_function(func)
		{ }

		~fiber_task() noexcept
		{
			if (m_script_fiber)
			{
				DeleteFiber(m_script_fiber);
			}
		}

		HMODULE get_hmodule()
		{
			return m_hmodule;
		}

		script_func_t get_function()
		{
			return m_function;
		}

		void on_tick()
		{
			if (GetTickCount64() < m_wake_at)
				return;

			if (!m_main_fiber)
			{
				m_main_fiber = IsThreadAFiber() ? GetCurrentFiber() : ConvertThreadToFiber(nullptr);
			}

			if (m_script_fiber)
			{
				current_fiber_script = this;
				SwitchToFiber(m_script_fiber);
				current_fiber_script = nullptr;
			}
			else
			{

				m_script_fiber = CreateFiber(0, [](PVOID param)
					{
						auto this_script = static_cast<fiber_task*>(param);
						while (true)
						{
							this_script->m_function();
						}

					}, this);
			}
		}
		void wait(std::uint32_t time)
		{
			m_wake_at = GetTickCount64() + time;
			SwitchToFiber(m_main_fiber);
		}

		inline static fiber_task* get_current_script()
		{
			return current_fiber_script;
		}
	private:
		HMODULE m_hmodule{};
		script_func_t m_function{};

		std::uint32_t m_wake_at{};
		void* m_script_fiber{};
		void* m_main_fiber{};

		inline static fiber_task* current_fiber_script{};
	};
}

class Fiber : public Singleton<Fiber>
{
public:
	std::unique_ptr<fiber::fiber_task> s_game_fiber;

	void Call();
	void OnNativeThread();
};



namespace rage
{

	class thread_queue_mgr
	{
	public:

		template <typename Func, typename... Args>
		inline static void native_emplace(const Func& task_func, Args &&...args) {
			funcs_to_invoke.emplace_back(
				std::make_pair(std::async(std::launch::deferred, task_func, args...),
					GetTickCount64()));
		}

		void on_native_tick() {
			auto current_tick = GetTickCount64();
			for (auto& funcs : funcs_to_invoke) {
				if (current_tick - funcs.second < 1000) {
					funcs.first.get();
				}
			}

			funcs_to_invoke.clear();
		}
	private:
		inline static std::vector<std::pair<std::future<void>, uintptr_t>> funcs_to_invoke;
	};

	inline thread_queue_mgr* native_queue{};
}




#include "../src/Main/maps.h"









namespace rage
{
	class scr_native_call_context
	{
	protected:
		void* m_return; // 0x0
		std::uint32_t m_arg_counter; // 0x8
		void* m_args; // 0x16
		std::uint32_t m_data_count; // 0x24
		alignas(std::uintptr_t) std::uint8_t m_vector_space[192]; // 0x32

	public:
		template<typename T>
		inline T get_argument(int idx)
		{
			std::uintptr_t* args = reinterpret_cast<std::uintptr_t*>(m_args);
			return *reinterpret_cast<T*>(&args[idx]);
		}

		inline void* get_argument_buffer()
		{
			return m_args;
		}

		template<typename T>
		inline void set_argument(int idx, T value)
		{
			std::uintptr_t* args = reinterpret_cast<std::uintptr_t*>(m_args);
			*reinterpret_cast<T*>(&args[idx]) = value;
		}

		template<typename T>
		inline void set_result(int idx, T value)
		{
			std::uintptr_t* return_values = reinterpret_cast<std::uintptr_t*>(m_return);
			*reinterpret_cast<T*>(&return_values[idx]) = value;
		}

		inline int get_argument_count()
		{
			return m_arg_counter;
		}

		template<typename T>
		inline T get_result(int idx)
		{
			std::uintptr_t* return_values = reinterpret_cast<std::uintptr_t*>(m_return);
			return *reinterpret_cast<T*>(&return_values[idx]);
		}

		inline void set_vector_result() { }
	};

	enum e_thread_state
	{
		state_idle,
		state_running,
		state_killed,
		state_3,
		state_4,
	};

	struct scr_thread_context
	{
		std::uint32_t thread_id;
		std::uint32_t script_hash;
		e_thread_state state;
		std::uint32_t ip;
		std::uint32_t frame_sp;
		std::uint32_t sp;
		std::uint32_t timer_a;
		std::uint32_t timer_b;
		std::uint32_t timer_c;
		std::uint32_t unk1;
		std::uint32_t unk2;
		std::uint32_t f2c;
		std::uint32_t f30;
		std::uint32_t f34;
		std::uint32_t f38;
		std::uint32_t f3c;
		std::uint32_t f40;
		std::uint32_t f44;
		std::uint32_t f48;
		std::uint32_t f4c;
		std::uint32_t f50;

		std::uint32_t pad1;
		std::uint32_t pad2;
		std::uint32_t pad3;

		std::uint32_t _set1;

		std::uint32_t pad[68 / 4];
	};
	static_assert(sizeof(scr_thread_context) == 0xA8, "scr_thread_context size mismatch");

	class scr_thread
	{
	public:
		//virtual ~scrThread() = 0;
		virtual void deconstructor() = 0;
		virtual e_thread_state reset(std::uint32_t script_hash, void* args, std::uint32_t arg_count) = 0;
		virtual e_thread_state run() = 0;
		virtual e_thread_state tick(std::uint32_t ops_to_execute) = 0;
		virtual void kill() = 0;

		e_thread_state get_thread_state() {
			return *reinterpret_cast<e_thread_state*>(reinterpret_cast<std::uintptr_t>(this) + 0x10);
		}

		scr_thread_context* get_context() {
			return &m_ctx;
		}

		scr_thread_context m_ctx;
		void* m_stack;
		void* pad;
		void* pad2;
		const char* exit_message;
	};

	class gta_thread : public scr_thread
	{
	public:
		virtual void deconstructor() = 0;
		virtual e_thread_state reset(std::uint32_t script_hash, void* args, std::uint32_t arg_count) = 0;
		virtual e_thread_state run() = 0;
		virtual e_thread_state tick(std::uint32_t ops_to_execute) = 0;
		virtual void kill() = 0;
	};

	template<typename T> class pg_ptr_collection
	{
	private:
		T** m_data;
		std::uint16_t m_count;
		std::uint16_t m_size;

	public:
		T** begin()
		{
			return m_data;
		}

		T** end()
		{
			return (m_data + m_count);
		}

		T* at(std::uint16_t index)
		{
			return m_data[index];
		}

		std::uint16_t count()
		{
			return m_count;
		}

		void set(std::uint16_t index, T* ptr)
		{
			m_data[index] = ptr;
		}
	};

	typedef struct {
		void(*deconstructor)(gta_thread* _this);
		e_thread_state(*reset)(gta_thread* _this, std::uint32_t script_hash, void* args, std::uint32_t arg_count);
		e_thread_state(*run)(gta_thread* _this);
		e_thread_state(*tick)(gta_thread* _this, std::uint32_t ops_to_execute);
		void(*kill)(gta_thread* _this);
		void(*unk001)();
	} gta_thread_vtable;
}








#include <iostream>
#include <Windows.h>
#include <cstdint>
#include <vector>
#include <sstream>
#include <fstream>
#include <filesystem>
#include <memory>
#include <future>
#include <future>

class memory_handle
{
public:
	/**
	 * \brief Constructs the object with a pointer
	 * \param p The pointer to initialize the object with, optional
	 */
	constexpr memory_handle(void* p = nullptr) :
		m_ptr(p)
	{}

	/**
	 * \brief Constructs the object with an integral pointer
	 * \param p The integral pointer to initialize the object with
	 */
	explicit memory_handle(std::uintptr_t p) :
		m_ptr(reinterpret_cast<void*>(p))
	{}

	/**
	 * \brief Retrieves the pointer as a pointer
	 * \return A pointer
	 */
	template <typename T>
	constexpr std::enable_if_t<std::is_pointer_v<T>, T> as()
	{
		return static_cast<T>(m_ptr);
	}

	/**
	 * \brief Retrieves the pointer as a reference
	 * \return A pointer
	 */
	template <typename T>
	constexpr std::enable_if_t<std::is_lvalue_reference_v<T>, T> as()
	{
		return *static_cast<std::add_pointer_t<std::remove_reference_t<T>>>(m_ptr);
	}

	/**
	 * \brief Retrieves the pointer as an integral pointer
	 * \return An integral pointer
	 */
	template <typename T>
	constexpr std::enable_if_t<std::is_same_v<T, std::uintptr_t>, T> as()
	{
		return reinterpret_cast<T>(m_ptr);
	}

	/**
	 * \brief adds an offset to the pointer
	 * \param offset The offset to be added
	 * \return memory_handle
	 */
	template <typename T>
	constexpr memory_handle add(T offset)
	{
		return memory_handle(as<std::uintptr_t>() + offset);
	}

	/**
	 * \brief subtracted an offset to the pointer
	 * \param offset The offset to be subtracted
	 * \return memory_handle
	 */
	template <typename T>
	constexpr memory_handle sub(T offset)
	{
		return memory_handle(as<std::uintptr_t>() - offset);
	}

	/**
	 * \brief Gets the relative displacement of the pointer
	 * \return memory_handle
	 */
	constexpr memory_handle rip()
	{
		if (!m_ptr)
			return nullptr;
		return add(as<std::int32_t&>()).add(4U);
	}

	/**
	 * \brief Checks if the stored pointer is valid
	 * \return bool
	 */
	constexpr explicit operator bool() noexcept
	{
		return m_ptr;
	}
protected:
	void* m_ptr;
};

class memory_region
{
public:
	/**
	 * \brief Constructs the region
	 * \param base The base of the region
	 * \param size The size of the region
	 */
	constexpr explicit memory_region(memory_handle base, std::size_t size) :
		m_base(base),
		m_size(size)
	{}

	/**
	 * \brief Gets the base of the region
	 * \return memory_handle
	 */
	constexpr memory_handle base()
	{
		return m_base;
	}

	/**
	 * \brief Gets the end of the region
	 * \return memory_handle
	 */
	constexpr memory_handle end()
	{
		return m_base.add(m_size);
	}

	/**
	 * \brief Gets the size of the region
	 * \return std::size_t
	 */
	constexpr std::size_t size()
	{
		return m_size;
	}

	/**
	 * \brief Checks if p is within this region
	 * \param p The pointer
	 * \return bool
	 */
	constexpr bool contains(memory_handle p)
	{
		if (p.as<std::uintptr_t>() < m_base.as<std::uintptr_t>())
			return false;
		if (p.as<std::uintptr_t>() > m_base.add(m_size).as<std::uintptr_t>())
			return false;

		return true;
	}
protected:
	memory_handle m_base;
	std::size_t m_size;
};

class module : public memory_region
{
public:
	/**
	 * \brief Constructs the class with the main modue
	 */
	explicit module(std::nullptr_t) :
		module(static_cast<char*>(nullptr))
	{}

	/**
	 * \brief Constructs the class with a module name
	 * \param name The name of the module
	 */
	explicit module(const char* name) :
		module(GetModuleHandleA("multiplayer.dll"))
	{
	}

	/**
	 * \brief Constructs the class with a module base
	 */
	module(HMODULE hmod) :
		memory_region(hmod, 0)
	{
		auto dos_header = m_base.as<IMAGE_DOS_HEADER*>();
		auto nt_header = m_base.add(dos_header->e_lfanew).as<IMAGE_NT_HEADERS64*>();
		m_size = nt_header->OptionalHeader.SizeOfImage;
	}

	/**
	 * \brief Gets the DOS headers for the module
	 */
	IMAGE_DOS_HEADER* get_dos_headers()
	{
		return m_base.as<IMAGE_DOS_HEADER*>();
	}

	/**
	 * \brief Gets the NT headers for the module
	 */
	IMAGE_NT_HEADERS64* get_nt_headers()
	{
		return m_base.add(m_base.as<IMAGE_DOS_HEADER*>()->e_lfanew).as<IMAGE_NT_HEADERS64*>();
	}
private:
	/**
	 * \brief Transforms a relative virtual address to a virtual address
	 */
	template <typename t_return, typename t_offset>
	t_return get_rva(t_offset rva)
	{
		return m_base.add(rva).as<t_return>();
	}
};


class signature
{
public:
	struct element
	{
		std::uint8_t m_data{};
		bool m_wildcard{};
	};

	/**
	 * \brief Constructs the signature with an IDA pattern
	 * \param pattern The IDA pattern string
	 */
	explicit signature(const char* pattern)
	{
		auto to_upper = [](char c) -> char
			{
				return c >= 'a' && c <= 'z' ? static_cast<char>(c + ('A' - 'a')) : static_cast<char>(c);
			};

		auto is_hex = [&](char c) -> bool
			{
				switch (to_upper(c))
				{
				case '0':
				case '1':
				case '2':
				case '3':
				case '4':
				case '5':
				case '6':
				case '7':
				case '8':
				case '9':
				case 'A':
				case 'B':
				case 'C':
				case 'D':
				case 'E':
				case 'F':
					return true;
				default:
					return false;
				}
			};

		do
		{
			if (*pattern == ' ')
				continue;
			if (*pattern == '?')
			{
				m_elements.push_back(element{ {}, true });
				continue;
			}

			if (*(pattern + 1) && is_hex(*pattern) && is_hex(*(pattern + 1)))
			{
				char str[3] = { *pattern, *(pattern + 1), '\0' };
				auto data = std::strtol(str, nullptr, 16);

				m_elements.push_back(element{ static_cast<std::uint8_t>(data), false });
			}
		} while (*(pattern++));
	}

	/**
	 * \brief scans for the pattern in a memory region
	 * \param region The region to search in, default is the main module
	 * \return memory_handle
	 */
	memory_handle scan()
	{
		std::future<memory_handle> future_result = std::async(std::launch::async, [&]() {
			memory_region region = module(nullptr);

			auto compare_memory = [](std::uint8_t* data, element* elem, std::size_t num) -> bool
				{
					for (std::size_t i = 0; i < num; ++i)
					{
						if (!elem[i].m_wildcard)
							if (data[i] != elem[i].m_data)
								return false;
					}

					return true;
				};

			for (std::uintptr_t i = region.base().as<std::uintptr_t>(), end = region.end().as<std::uintptr_t>(); i != end; ++i)
			{
				if (compare_memory(reinterpret_cast<std::uint8_t*>(i), m_elements.data(), m_elements.size()))
				{
					return memory_handle(i);
				}
			}

			return memory_handle();
			});

		return future_result.get();
	}

private:
	std::vector<element> m_elements;
};
inline bool is_valid_ptr(void* ptr) {
	return ptr != nullptr;
}
inline LPVOID check_ptr(const char* label, LPVOID sig) {
	if (!is_valid_ptr(sig)) {
		char buffer[256];
		sprintf_s(buffer, "failed to find %s", label);
		throw std::runtime_error(buffer);
	}
	return sig;
}

class c_ped; // def CPed
class c_vehicle; // def CVehicle

namespace rage {
	//struct vector3 {}; // def Vector3
	namespace pools {
		enum e_rage_pool {
			player_pool = 0,
			vehicle_pool = 1,
			object_pool = 2,
			pickups_pool = 3,
			blips_pool = 4,
			checkpoints_pool = 5,
			markers_pool = 6,
			colshapes_pool = 7,
			labels_pool = 8,
			dummies_pool = 9,
			peds_pool = 10
		};

		const e_rage_pool e_all_pools[] = { e_rage_pool::player_pool, e_rage_pool::vehicle_pool,
			e_rage_pool::object_pool, e_rage_pool::pickups_pool,
			e_rage_pool::blips_pool, e_rage_pool::checkpoints_pool,
			e_rage_pool::markers_pool, e_rage_pool::colshapes_pool,
			e_rage_pool::labels_pool, e_rage_pool::dummies_pool, e_rage_pool::peds_pool
		};

		struct s_player {
			char pad_0x0000[0x18]; //0x0000
			std::uint32_t model_hash; //0x0018 
			char pad_0x001C[0xF4]; //0x001C
			std::uint32_t handle; //0x0110 
			char pad_0x0114[0x54]; //0x0114
			struct _ { // 0x0168
				char pad_00[0x18];
				c_ped* m_ped;
			} *m_ped_link;
			char pad_0x0170[0x18]; //0x0170
			std::string name; //0x0188 
			char pad_0x0190[0x2E]; //0x0190
			std::uint8_t alpha; //0x01D6 

		public:
			std::uintptr_t** get_js_object() {
				return reinterpret_cast<std::uintptr_t**>(std::uintptr_t(this) + 0x70);
			}
		};

		struct s_vehicle {
			char pad_0000[24]; //0x0000
			std::uint32_t model_hash; //0x0018
			char pad_001C[2668]; //0x001C
			c_vehicle* m_vehicle; //0x0A88
			std::uint32_t handle; //0x0A90
		};

		struct s_object {
			char pad_0x0000[0x18]; //0x0000
			std::uint32_t model_hash; //0x0018 
			char pad_0x001C[0xAC]; //0x001C
			//rage::vector3 position; //0x00C8 
		};

		struct s_npc {
			char pad_0x0000[0x18]; //0x0000
			std::uint32_t model_hash; //0x0018 
			char pad_0x001C[0xE4]; //0x001C
			std::uint32_t handle; //0x0100 
			char pad_0x0104[0x4]; //0x0104
			c_ped* m_ped; //0x0108 
		};

		std::vector<s_player*> get_players();
		std::vector<s_vehicle*> get_vehicles();
		std::vector<s_object*> get_objects();
		std::vector<s_npc*> get_npcs();
		std::vector<uintptr_t> get_markers();

		s_player* get_local_player();
		s_vehicle* get_local_vehicle();

		s_player* get_player(std::size_t index);
		s_vehicle* get_vehicle(std::size_t index);
		s_object* get_object(std::size_t index);
		s_npc* get_npc(std::size_t index);
		std::uintptr_t get_marker(std::size_t index);

		s_vehicle* find_vehicle(c_vehicle* vehicle);
		s_player* find_player(c_ped* ped);
	}
}


namespace gta::functions {
	using fix_context_vector_t = void(*)(void* context);
	using native_handler_t = void(*)(rage::scr_native_call_context* context);
	using get_native_handler_t = native_handler_t(*)(std::uintptr_t hash);
	using thread_call_t = rage::e_thread_state(*)(rage::gta_thread* _this);
	using thread_switch_tls_t = std::uintptr_t(*)(rage::gta_thread* thread);

